thall-is/mps3/espidf/sdkconfig.defaults
# ============================================================================
# sdkconfig.defaults - ESP32-S3-WROOM-1 N16R8 (ESP-IDF Puro)
#   Flash : 16MB Quad SPI
#   PSRAM :  8MB Octal SPI
# ============================================================================

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Partição customizada (4MB app) ---
# OBRIGATÓRIO: sem isso o ESP-IDF usa partição de 1MB e o firmware não cabe!
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- Flash ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- PSRAM (octal, no N16R8) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512

# --- FATFS: nomes de arquivo longos (titulos de musica, subpastas) ---
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_CODEPAGE_850=y

# --- Stacks ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- CPU a 240MHz para dar folga na decodificacao ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000

# --- USB TinyUSB ---
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=8192
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_CDC_RX_BUFSIZE=512
CONFIG_TINYUSB_CDC_TX_BUFSIZE=512
CONFIG_TINYUSB_CDC_EP_BUFSIZE=64
CONFIG_TINYUSB_HID_COUNT=1

# --- lwIP: buffers de TCP de alto desempenho para transferencia rapida via WiFi ---
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
CONFIG_LWIP_MAX_ACTIVE_TCP=8

# --- mDNS ---
CONFIG_MDNS_ENABLED=y

# --- Task Watchdog: Desativa checagem de IDLE na CPU 0 (Core 0 dedicado exclusivamente ao DSP de áudio Hi-Res) ---
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

# --- Alocacao de buffers Wi-Fi/lwIP na PSRAM (Alto Throughput 802.11n) ---
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=16
CONFIG_ESP_WIFI_TX_BA_WIN=16
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# --- Rollback OTA ---
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
